prompt Sviews
CREATE OR REPLACE
PACKAGE SVIEWS IS
/*
 *	$HeadURL: http://hades.ftc.ru:7382/svn/pltm2/CorePkg/tags/7.4.9.3/IBS/SVIEWS1.sql $
 *  $Author: zikov $
 *  $Revision: 66709 $
 *  $Date:: 2015-02-19 11:49:53 #$
 */
--------------------------------------------------
-- Создание всех view
PROCEDURE Create_All_Sviews;
--------------------------------------------------
-- Создание view для списка доступных понятий
PROCEDURE Create_Vw_Ent;
--------------------------------------------------
-- Создание view для списка справочников
PROCEDURE Create_Vw_Guides;
--------------------------------------------------
-- Создание view для User списка доступных типов понятий
PROCEDURE Create_Vw_Cls_User;
--------------------------------------------------
-- Создание view для списка администраторского списка критериев
PROCEDURE Create_Vw_Criteria_Admin;
--------------------------------------------------
-- Создание view для списка пользовательского списка критериев
PROCEDURE Create_Vw_Criteria_User;
--------------------------------------------------
-- Создание view для списка колонок критериев
PROCEDURE Create_Vw_Criteria_Columns;
--------------------------------------------------
-- Создание view для списка колонок критериев для DVS
PROCEDURE Create_Vw_Columns;
--------------------------------------------------
-- Создание view для списка всех объектов
PROCEDURE Create_Vw_Objects;
--------------------------------------------------
-- Создание view для администраторского списка методов
PROCEDURE Create_Vw_Methods_Admin;
--------------------------------------------------
-- Создание view для пользовательского списка методов
PROCEDURE Create_Vw_Methods_User;
--------------------------------------------------
-- Создание view для пользовательского списка переходов
PROCEDURE Create_Vw_Transitions;
--------------------------------------------------
-- Создание view для пользовательского меню
PROCEDURE Create_Vw_Favorites;
----------------------------------------------------------
-- Создание view для групп методов
PROCEDURE Create_Vw_Method_Groups;
----------------------------------------------------------
-- Создание view для OLE реквизитов
PROCEDURE Create_Vw_Long_Data;
----------------------------------------------------------
-- Создание view для групп справочников
PROCEDURE Create_Vw_Guide_Groups;
----------------------------------------------------------
-- Создание view для списка доступных типов
PROCEDURE Create_Accessible_Classes;
----------------------------------------------------------
-- Создание view для списка сессий
PROCEDURE Create_Vw_User_Sessions;
----------------------------------------------------------
-- Создание views для Метаданных
PROCEDURE Create_Metadata_Views;
----------------------------------------------------------
-- Создание views для иерархической системы безопасности
PROCEDURE Create_Vw_Security;
----------------------------------------------------------
-- Создание view с информацией о профилях секционирования
PROCEDURE Create_Vw_Partitioning_Profils;
------------------------------------------------------------------
-- Создание view с информацией о секционировании по профилю ТБП
PROCEDURE Create_Vw_Partitioning_Classes;
------------------------------------------------------------------
-- Создание view с информацией об условиях секционирования профилей
PROCEDURE Create_Vw_Partitioning_Conds;
------------------------------------------------------------------
-- Создание view с информацией о профилях подсекций
PROCEDURE Create_Vw_Part_SubProfs;
------------------------------------------------------------------
-- Создание view с информацией об условиях подсекционирования
PROCEDURE Create_Vw_Part_SubProf_Conds;
---------------------------------------------------------------------
-- Создание view с информацией о секционировании по профилю подсекций ТБП
PROCEDURE Create_Vw_Part_Subprof_Classes;
--------------------------------------------------------------------
-- Создание view с информацией о секциях таблицы ТБП
PROCEDURE Create_Vw_Class_Partitions;
--------------------------------------------------------------------
-- Создание view с информацией об подсекциях таблицы ТБП
PROCEDURE Create_Vw_Class_Subpartitions;
------------------------------------------------------------------
-- Создание view с информацией секционированных индексов
PROCEDURE Create_Vw_Part_Indexes;
------------------------------------------------------------------
-- Создание view с информацией о секциях индексов таблицы ТБП
--------------------------------------------------------------------
PROCEDURE Create_Vw_Class_Ind_Partitions;
--------------------------------------------------------------------
-- Создание view с информацией о подсекциях индексов таблицы ТБП
PROCEDURE Create_Vw_Class_Ind_SubParts;
END;
/
sho err
